[net]
# Training
# batch=128
# subdivisions=4

# Testing
batch=1
subdivisions=1

height=224
width=224
channels=3
learning_rate=0.00001
momentum=0.9
decay=0.0005

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[connected]
output=1000
activation=linear

[softmax]
groups=1


